use std::collections::HashMap;
use once_cell::sync::Lazy;

pub static SPECIES_HASHMAP: Lazy<HashMap<&'static str, (&'static str, &'static str)>> = Lazy::new(|| {
    let map = [
        (
            "rice leaf roller",
            (
                "稻纵卷叶螟",
                "稻纵卷叶螟，学名：Cnaphalocrocis medinalis Guenee，是鳞翅目草螟科纵卷叶野螟属节肢动物。又称水稻瘤野螟、卷叶虫、刮青虫、白叶虫等。成虫是小型蛾子，雌蛾体长8-9毫米，翅展18毫米，体、翅淡黄褐色，前翅有3条黑褐色条斑，内、外横条斑斜贯翅面，中间1条很短，翅外缘有1条黑褐色宽边。后翅也有2横带，内横线短，不达边缘，外缘也有灰黑色宽带。身体背面黄褐色，腹面白色。雄蛾体稍小，色泽较鲜艳，前、后翅斑纹与雌蛾相近，但前翅前缘中央有1个突起的小黑点，黑点附近有暗褐色毛和黄褐色长毛，呈眼状。静止时前后翅斜展在背部两旁，雄蛾尾部举起。"
            )
        ),
        (
            "rice leaf caterpillar",
            (
                "稻螟蛉",
                "稻螟蛉，学名：Naranga aenescens Moore，夜蛾科螟蛉夜蛾属的一种昆虫。又称双带夜蛾，稻青虫、粽子虫、量尺虫。遍布中国各地。除为害水稻外，还为害高粱、玉米、甘蔗、茭白及取食多种禾本科杂草。以幼虫食害稻叶，1~2龄将叶片食成白色条纹，3龄后将叶片食成缺刻，严重时将叶片咬成破碎不堪，仅剩中肋。秧苗期受害最重。"
            )
        ),
        (
            "paddy stem maggot",
            (
                "稻潜叶蝇",
                "稻潜叶蝇，学名：Hydrellia griseola，又名稻小潜叶蝇、夹叶虫、蛀叶虫。为双翅目，水蝇科。分布东北、华北、浙江等地。除危害水稻外，还危害大麦、小麦，以及危害看麦娘、稗草等禾本科杂草。幼虫潜入水稻叶片组织内，吃食叶肉，留下表皮，造成不规则的白色斑块。叶组织被破坏后，水分渗入，腐生菌繁殖，引起叶片腐烂。严重时，叶片枯黄腐烂，甚至全株枯死。"
            )
        ),
        (
            "asiatic rice borer",
            (
                "水稻二化螟",
                "水稻二化螟，学名：Chilo suppressalis，是鳞翅目草螟科禾草螟属昆虫，又称蛀心虫、蛀秆虫、枯心虫。成虫为黄褐色或灰褐色，雌大雄小；前翅略呈长方形，后翅均白色。雄蛾前翅黄褐至灰褐色，翅面密布褐色不规则小点，前翅中央有1个灰黑色斑点，其下有3个斜行排列的灰黑色斑点，腹部瘦圆筒形。雌蛾前翅褐色，翅面小点不明显，沿外缘有7个小黑点，有绢丝光泽，腹部纺锤形，灰白色。幼虫头部淡红褐色，胴部淡褐色，腹足较发达，趾钩三序全环。"
            )
        ),
        (
            "yellow rice borer",
            (
                "水稻三化螟",
                "水稻三化螟，学名：Scirpophaga incertulas，是鳞翅目螟蛾科蛀禾螟属动物。三化螟雄峨体长8-9毫米，头、胸部背面和前翅淡灰褐色；前翅三角形，中央具1小黑点，翅尖至内缘中央有1条暗褐色斜纹，沿外缘有7个小黑点，后翅灰白色，腹部细瘦，末端尖，无茸毛；雌体长10-13毫米，翅展23毫米,体淡黄色或黄白色；前翅中央有一个很明显的小黑点，后翅白色，腹部较肥大，末端长有棕褐色茸毛。三化螟俗称钻心虫、白穂虫。"
            )
        ),
        (
            "rice gall midge",
            (
                "稻瘿蚊",
                "稻瘿蚊，学名：Orseolia oryzae Wood-Mason，双翅目，瘿蚊科的一种昆虫。别名 稻瘿蝇。在幼虫期吸食水稻生长点汁液，致使水稻不能抽穗。现分布于广东、广西、福建、云南、贵州、海南、江西、湖南、台湾。据江西广昌县观察，该虫从石城县进入广昌县以后，每年仍以10一20km的速度向北蔓延。寄主 水稻、李氏禾等。"
            )
        ),
        (
            "Rice Stemfly",
            (
                "稻秆蝇",
                "稻秆蝇，学名：Atherigona exigua Stein，又称稻秆潜蝇，昆虫纲动物。国内分布于华南、西南各省（区），广东的山区和丘陵区稻区普遍发生。为害水稻，也寄生在游草、稗草与看麦娘上。以幼虫钻入稻茎内为害心叶、生长点或幼穗，心叶抽出后出现小孔或白斑点，被害叶尖变黄褐色，展叶后叶上有若干条细长并列的裂缝；被害幼穗变为畸形或成白穗。"
            )
        ),
        (
            "brown plant hopper",
            (
                "稻褐飞虱",
                "稻褐飞虱，学名：Nilaparvata lugens(Stal)，为同翅目飞虱科褐飞虱属的一个物种。分布于中国广大地区，北起吉林，沿辽宁、河北、山西、陕西、宁夏至甘肃，西向由甘肃折入四川、云南、西藏。"
            )
        ),
        (
            "white backed plant hopper",
            (
                "白背飞虱",
                "白背飞虱，学名：Sogatella furcifera (Horváth)，是半翅目飞虱科白背飞虱属昆虫。头顶、前胸背板和中胸背板中域黄白或姜黄色，但前胸背板复眼后方有一暗褐色斑，中胸背板侧区黑色或淡黑色；头顶端半两侧脊间、额、颊和唇基雄虫为黑色，雌虫为灰黄褐色；触角淡褐色，基节下面色较深暗；胸部腹面及腹部雄虫极大部分为黑褐色，雌虫为灰黄褐色，仅中胸腹板及腹部背面有一些黑褐色斑；各胸足除基节外，其余各节为污黄色；前翅淡黄褐几透明，有的翅端具烟污色晕斑，翅斑明显，黑褐色。短翅型体色概如长翅型。"
            )
        ),
        (
            "small brown plant hopper",
            (
                "灰飞虱",
                "灰飞虱，学名：Laodelphax striatellus (Fallén)，是半翅目飞虱科灰飞虱属的昆虫， [4]长翅型雌虫体长3.3-3.8毫米，短翅型体长2.4-2.6毫米，浅黄褐色至灰褐色，头顶稍突出，长度略大于或等于两复眼之间的距离，额区具黑色纵沟2条，额侧脊呈弧形；前胸背板、触角浅黄色；小盾片中间黄白色至黄褐色，两侧各具半月形褐色条斑纹，中胸背板黑褐色，前翅较透明，中间生一褐翅斑；卵初产时乳白色略透明，后变浅黄色，香蕉形，双行排成块；末龄若虫体长2.7毫米，前翅芽较后翅芽长，若虫共5龄。"
            )
        ),
        (
            "rice water weevil",
            (
                "稻水象甲",
                "稻水象甲，学名：Lissorhoptrus oryzophilus，是象虫科稻水象属昆虫，又名稻水象、稻根象。成虫体长2.6-3.8毫米，体壁褐色，密被相互连接的灰色鳞片。前胸背板和鞘翅的中区无鳞片，呈黑褐色或暗褐色。喙端部和腹面、触角沟两侧、头和前胸背板基部、眼四周，前、中、后足基节基部、腹部第3节、第4节腹面及腹部末端被黄色圆形鳞片，其余各部鳞片均灰色。喙近扁圆筒形，略弯曲，与前胸背板约等长。触角膝状，柄节棒形，触角棒倒卵形或长椭圆形，长为宽的2.0-2.1倍，分为3节；前胸背板宽略大于长，前端略收缩，两侧边近直形，小盾片不明显；鞘翅明显具肩。足腿节棒形，无齿；胫节细长弯曲，中足胫节两侧各有一排长的游泳毛。卵圆柱形，有时略弯，两端圆，长约0.8毫米，初产时呈珍珠白色。"
            )
        ),
        (
            "rice leafhopper",
            (
                "稻叶蝉",
                "稻叶蝉，学名：Nephotettix cincticeps，是危害水稻的叶蝉类昆虫的统称，是我国水稻的重要害虫，广泛分布于各稻区，尤以南方稻区发生较重，同稻飞虱相似，除直接取食危害外，还传播水稻病毒病，后者的危害常超过直接吸食。国内常见的稻田叶蝉有10多种，以黑尾叶蝉发生最普遍。广东、广西及云南、四川南部等地则以二点黑尾叶蝉或二条黑尾叶蝉为优势种。"
            )
        ),
        (
            "grain spreader thrips",
            (
                "谷物撒布蓟马",
                "谷物撒布蓟马，学名：未知（grain spreader thrips），暂无词条"
            )
        ),
        (
            "rice shell pest",
            (
                "稻苞虫",
                "稻苞虫，学名：Parnara guttata，稻苞虫又名直纹稻弄蝶、一字纹稻弄蝶、苞叶虫等 [3]，属鳞翅目 [4]弄蝶科是水稻上一种食叶害虫 [3]。稻苞虫体长17-19毫米。体和翅黑褐色，有金黄色光泽。头胸部比腹部宽，略带绿色。雄蝶中室端2个斑大小基本一致，而雌蝶上方1个长/大、下方1个多退化成小占或消失。"
            )
        ),
        (
            "grub",
            (
                "蛴螬",
                "蛴螬，是金龟子或金龟甲的幼虫，俗称鸡乸虫等。成虫通称为金龟子或金龟甲。危害多种植物和蔬菜。按其食性可分为植食性、粪食性、腐食性三类。其中植食性蛴螬食性广泛，危害多种农作物、经济作物和花卉苗木，喜食刚播种的种子、根、块茎以及幼苗，是世界性的地下害虫，对作物危害很大。此外某些种类的蛴螬可入药，对人类有益。"
            )
        ),
        (
            "mole cricket",
            (
                "蝼蛄",
                "蝼蛄（Gryllotalpa spps）是节肢动物门，昆虫纲，直翅目，蟋蟀总科，蝼蛄科昆虫的总称。蝼蛄俗名拉拉蛄，地拉蛄，天蝼，土狗等，是药用昆虫。我国大陆上常见的分布较广的蝼蛄有5种，分别是华北蝼蛄（Gryllotalpa unispina Saussure）、东方蝼蛄（Gryllotalpa orientalis Burmeister）、金秀蝼蛄（Gryllotalpa jinxiuensis You & Li）、河南蝼蛄（Gryllotalpa henana Cai & Niu）和台湾蝼蛄（Gryllotalpa formosana Shiraki）。一般入药的主要是华北蝼蛄和东方蝼蛄。药用通常为蝼蛄科昆虫蝼蛄的干燥成虫和大个若虫全体。"
            )
        ),
        (
            "wireworm",
            (
                "金针虫",
                "金针虫，是鞘翅目叩甲科昆虫幼虫的统称，又称铁丝虫、铁条虫、蛘虫。身体细长，圆柱形略扁；体壁光滑、坚韧，头和体末节坚硬；无上唇。颜色多数为黄色或黄褐色。因形似金针而得名。"
            )
        ),
        (
            "white margined moth",
            (
                "白边舟蛾",
                "榆白边舟蛾，学名：Nerice davidi oberthür，是舟蛾科边舟蛾属的一种昆虫。"
            )
        ),
        (
            "black cutworm",
            (
                "小地老虎",
                "小地老虎，学名：Agrotis ipsilon，是鳞翅目夜蛾科地老虎属昆虫，又称地蚕、土蚕、切根虫。前翅暗褐色，肾状斑外有1尖长楔形斑，亚缘线上也有2个尖端向里的楔形斑；后翅灰白色，翅脉及边缘黑褐色，缘毛灰白色；触角（雄）分支仅达1/2处，其余为丝状。幼虫灰褐色，各节背板上有2对毛片，前面1对小于后面1对；气门菱形；臀板黄褐色，有深色纵线2条。雌蛾寿命为20—25天，雄蛾为10—15天。"
            )
        ),
        (
            "large cutworm",
            (
                "大地老虎",
                "大地老虎，又称“切根虫、截虫”，是鳞翅目夜峨科的昆虫。 [3]成虫体长20-22毫米，翅展45-48毫米，头部、胸部褐色。腹部、前翅灰褐色，外横线以内前缘区、中室暗褐色，内横线波浪形，双线黑色，环纹具黑边圆形褐色，肾纹大具黑边，褐色，外侧具１黑斑近达外横线，中横线褐色，外横线锯齿状双线褐色，亚缘线锯齿形浅褐色，缘线呈一列黑色点，后翅浅黄褐色。"
            )
        ),
        (
            "yellow cutworm",
            (
                "黄地老虎",
                "黄地老虎，学名：Agrotis segetum (Denis et Schiffermüller) ，夜蛾科地夜蛾属的一个物种。成虫体长14～19毫米，翅展32～43毫米。全体黄褐色。前翅亚基线及内、中、外横纹不很明显；肾形纹、环形纹和楔形纹均甚明显，各围以黑褐色边，后翅白色，前缘略带黄褐色。卵半圆形，底平，直径约0.5毫米。"
            )
        ),
        (
            "red spider",
            (
                "红蜘蛛",
                "红蜘蛛，学名：Tetranychus cinnbarinus，是蜱螨目叶螨科节肢动物。雌成虫体卵圆形，体背隆起，有细皱纹，有刚毛；雌虫有越冬型和非越冬型之分，前者鲜红色，后者暗红色；雄成虫体较雌成虫小，卵圆球形，半透明，表面光滑，有光泽，橙红色。"
            )
        ),
        (
            "corn borer",
            (
                "玉米螟",
                "玉米螟，学名：Ostrinia furnacalis，是鳞翅目螟蛾科野秆螟属节肢动物，又称箭秆虫、玉米钻心虫。成虫为中小型的黄色小蛾子。雄虫较瘦小、色深；前翅内横线波状暗褐色，外横线锯齿状暗褐色，内、外横线间近前缘处有2个褐色斑纹，外横线与外缘线之间有1褐色带；后翅灰黄色，翅面上的横线与前翅相似，翅展时前后翅的波纹相连；翅缰1根。雌虫体较粗大、色浅；翅缰2根。"
            )
        ),
        (
            "army worm",
            (
                "夜蛾",
                "夜蛾，学名：Noctuidae，是鳞翅目夜蛾科昆虫的通称，全世界约有26000种，中国已知约有2110种。中等或大型，触角丝状，口器发达，嗜糖、酒、醋等；前翅较狭长，以黑褐色为主，杂有深色条纹或肾形纹；后翅三角形，灰或白色，少数为黄、橙或红色。成虫在夜间活动，故称夜蛾。"
            )
        ),
        (
            "aphids",
            (
                "蚜虫",
                "蚜虫，学名：Aphidoidea，是半翅目蚜总科的统称，包括蚜总科下的所有成员，目前已经发现的蚜虫总共有10个科约4400种，其中多数属于蚜科。常分为头、胸、腹三部分。体表光滑或分泌蜡粉、蜡丝覆盖虫体；体毛顶端尖锐或平钝，有时膨大为头状或扇状；腹管无、环状或管状；尾片多为半圆形、瘤状、长短不等的圆锥形、三角形和五角形等。蚜虫又名“蜜虫子”，因能产生蜜露而得名。"
            )
        ),
        (
            "Potosiabre vitarsis",
            (
                "白星花金龟",
                "白星花金龟，学名：Protaetia(Liocola) brevitarsis(Lewis)，是鞘翅目花金龟科昆虫。白星花金龟成虫扁圆形，全体紫铜色，有光泽；前胸背板前端两侧各有一个白色小斑，近后缘白色斑分布在两侧微凹点处；鞘翅基角稍向外突出，鞘翅上面有纵列的小刻点和大小不等的云片状斑纹；卵乳白色，圆形；幼虫体乳白色，常弯曲成“C”形，头部赤褐色，体背各节均有刚毛；裸蛹黄白色。"
            )
        ),
        (
            "peach borer",
            (
                "桃蛀螟",
                "桃蛀螟，学名：Dichocrocis punctiferalis，是鳞翅目草螟科多斑野螟属昆虫，又称桃蛀野螟、豹纹斑螟、桃蠹螟等。成虫黄至橙黄色；体、翅表面具许多黑斑点似豹纹；腹背第一和第三到第六各有3个横列，雄性第九节末端黑色，雌性不明显。幼虫体色多变，腹面多为淡绿色；头暗褐，前胸盾片褐色，臀板灰褐，各体节毛片明显，灰褐至黑褐色。"
            )
        ),
        (
            "english grain aphid",
            (
                "麦长管蚜",
                "麦长管蚜，学名：Sitobion avenae (Fabricius)，属同翅目，蚜科的一种昆虫。分布在中国各产麦区。寄主于小麦、大麦、燕麦，南方偶害水稻、玉米、甘蔗、获草等。前期集中在叶正面或背面，后期集中在穗上刺吸汁液，致受害株生长缓慢，分蘖减少，千粒重下降，是麦类作物重要害虫。也是麦蚜中的优势种。"
            )
        ),
        (
            "green bug",
            (
                "麦二叉蚜",
                "麦二叉蚜，学名：Schizaphisgraminum，麦二叉蚜常在麦类叶片正、反两面或基部叶鞘内外吸食汁液，致麦苗黄枯或伏地不能拔节，严重的麦株不能正常抽穗，直接影响产量，此外还可传带小麦黄矮病。2020年9月15日，麦二叉蚜被农业农村部列入一类农作物病虫害名录。"
            )
        ),
        (
            "bird cherry-oataphid",
            (
                "燕麦蚜茧蜂",
                "燕麦蚜茧蜂，学名：Aphidius avenae Haliday，是一种寄生于水稻稻田、隶属于蚜茧蜂科的膜翅目小动物。该蜂体型较小，褐色，雌、雄蜂相似，但是稍有不同。分布地区多集中在中国湖南，北京等地区。"
            )
        ),
        (
            "wheat blossom midge",
            (
                "小麦吸浆虫",
                "小麦吸浆虫，学名：Sitodiplosis mosellana (G6hin)，是双翅目瘘蚊科昆虫，主要有麦黄吸浆虫和麦红吸浆虫两种。 [5]吸浆虫雌成虫体长2-2.5毫米，翅展5毫米左右，体桔红色。前翅透明，有4条发达翅脉，后翅退化为平衡棍。雄虫每节中部收缩使各节呈葫芦结状，膨大部分各生一圈长环状毛。雌虫触角呈念珠状，上生一圈短环状毛。雄虫体长2毫米左右。卵长0.09毫米，长圆形，浅红色。幼虫体长约体长3-3.5毫米，椭圆形，橙黄色，头小，无足，蛆形，前胸腹面有1个“Y形”剑骨片，前端分叉，凹陷深。蛹长2毫米，裸蛹，橙褐色，头前方具白色短毛2根和长呼吸管1对。"
            )
        ),
        (
            "penthaleus major",
            (
                "小麦红蜘蛛",
                "小麦红蜘蛛，是一种对农作物危害性很大的昆虫，常分布于山东、山西、江苏、安徽、河南、四川、陕西等地。小麦、大麦、豌豆、苜蓿、杂草等一旦被侵害导致植株矮小，发育不良，重者干枯死亡。"
            )
        ),
        (
            "longlegged spider mite",
            (
                "麦长腿蜘蛛",
                "麦长腿蜘蛛，学名：Petrobia latens，发生于黄河以北至长城以南地区，如河北、山东、山西、内蒙古自治区等地。危害 小麦、大麦、豌豆、苜蓿、杂草。等作物。成、若虫都可危害，被害麦叶出现黄白小点，植株矮小，发育不良，重者干枯死亡。"
            )
        ),
        (
            "wheat phloeothrips",
            (
                "小麦根皮蓟马",
                "小麦根皮蓟马，学名：Haplothrips tritici Kurdjumov，昆虫名，属缨翅目，管蓟马科。小麦皮蓟马为害小麦花器，灌浆乳熟时吸食麦粒浆液，使麦粒灌浆不饱满。严重时麦粒空秕。还可为害麦穗的护颖和外颖，颖片受害后皱缩，枯萎，发黄，发白或呈黑褐斑，被害部极易受病菌侵害，造成霉烂、腐败。"
            )
        ),
        (
            "wheat sawfly",
            (
                "麦叶蜂",
                "麦叶蜂，学名：Dolerus tritici Chu，属于膜翅目，叶蜂总科，叶蜂科，世界记载共约170种。以幼虫危害麦叶，从叶边缘向内咬成缺刻，严重时可将全部叶尖吃掉。影响了小麦的光合作用，造成小麦的产量下降。成虫夜间潜伏在麦苗基部或浅土中, 白天活动、交配、产卵, 有假死性。"
            )
        ),
        (
            "cerodonta denticornis",
            (
                "麦黑斑潜叶蝇",
                "麦黑斑潜叶蝇，昆虫名，为双翅目，潜蝇科。分布甘肃、台湾等省。寄主于小麦、燕麦、大麦等。 幼虫潜食叶肉，潜痕弯曲窄细。"
            )
        ),
        (
            "beet fly",
            (
                "甜菜潜叶蝇",
                "甜菜潜叶蝇，学名：Pegomyia hyosciami Panzer，为双翅目，花蝇科甜菜潜叶蝇属的一个物种。分布于华北、东北、西北、江苏、湖南等省区。寄主植物有甜菜、藜科、蓼科植物。以幼虫蛀入寄主植物叶片内部潜食叶肉为害，被害处仅剩上、下表皮，被害叶片上可见迂迥曲折的灰白色隧道，使叶片枯萎、结英减少、籽粒不饱满，严重影响饲料作物、种子的产量和质量。"
            )
        ),
        (
            "flea beetle",
            (
                "跳甲",
                "跳甲属，Altica Goeffroy，1762，隶属于鞘翅目（Coleoptera）叶甲科（Chrysomelidae）跳甲亚科，是世界广布属，种类繁庶，已知约300多种，因其体色多为蓝色、蓝黑色、蓝紫色、蓝绿色、紫罗蓝色，外表差异不显著，种类近似，分类鉴定十分困难。"
            )
        ),
        (
            "cabbage army worm",
            (
                "甘蓝夜蛾",
                "甘蓝夜蛾，广泛分布于各地，是一种杂食性害虫，除大田作物、果树、野生植物外，对蔬菜也是一种主要害虫，它可危害甘蓝、白菜、萝卜、菠菜、胡萝卜等多种蔬菜。在昆虫分类中属于鳞翅目的夜蛾科。另外一个很普遍的名字称为甘蓝夜盗虫。"
            )
        ),
        (
            "beet army worm",
            (
                "甜菜夜蛾",
                "甜菜夜蛾，是鳞翅目夜蛾科动物，别名夜盗蛾、菜褐夜蛾、玉米夜蛾。成虫，体长8-10毫米，翅展19-25毫米，灰褐色。头、胸有黑点。前翅外缘线由1列黑色三角形小斑组成，翅面有黑白两色双线2条，有黄褐色肾状纹和环状纹。后翅银白色，翅脉及缘线黑褐色。"
            )
        ),
        (
            "Beet spot flies",
            (
                "甜菜斑蝇",
                "甜菜斑蝇，学名：Tetanopssp，鳞翅目夜蛾科动物。"
            )
        ),
        (
            "meadow moth",
            (
                "草地螟",
                "草地螟，学名：Loxostege sticticalis，是鳞翅目螟蛾科锥额野螟属昆虫，又名黄绿条螟、甜菜网螟、网锥额野螟、螺虫、罗网虫。成虫暗褐色，前翅灰褐色至暗褐色，翅中央稍近前方有一近方形淡黄色或浅褐色斑，翅外缘为黄白色，并有一连串的淡黄色小点连成条纹；后翅黄褐色或灰色，沿外缘有两条平行的黑色波状条纹；在挤压雌虫腹部时，腹末部有一圆形开口，其内伸出产卵器；雄虫在挤压腹末部时，腹端呈两片状向左右分开，其中有钩状的阳具和抱握器等。"
            )
        ),
        (
            "beet weevil",
            (
                "甜菜象虫",
                "甜菜象虫，学名：Bothynoderes punctiremtris Germar，是以越冬成虫在春夏之间咬食甜菜幼苗于叶和第一对真叶，大发生时，将子叶、第一对真叶及生长点全部食光，幼苗枯死，其幼虫啃食甜菜块根，造成植株变黄、枯萎。"
            )
        ),
        (
            "sericaorient alismots chulsky",
            (
                "东方绢金龟",
                "东方绢金龟，学名：Serica orientalis或Maladera orientalis，是一种鳃金龟科昆虫。食性杂，成虫和幼虫都可造成危害，可危害100多种植物。成虫嗜食杨、柳等植物叶片，常在春季造林时对杨树幼苗造成较大危害。分布于中国的东北、华北、宁夏、甘肃、河南、山东、江苏、安徽等省（区）；朝鲜、俄罗斯远东沿海地区、萨哈林岛和日本。"
            )
        ),
        (
            "alfalfa weevil",
            (
                "苜蓿叶象甲",
                "苜蓿叶象甲，学名：Hypera postica (Gyllenhal)，鞘翅目，象牙科，叶象属。分布在新疆、内蒙古和甘肃等地区。成虫和幼虫均能为害，但以幼虫为害第一茬苜蓿最严重。成虫为害白三叶草坪，虫口密度中等。幼虫造成最主要的危害，它们在植株顶部于初展开的叶上，后来在下部叶片上均进行采食。为害严重时，除主脉外全部吃光，使被害的草丛一望发白，惨不忍视。"
            )
        ),
        (
            "flax budworm",
            (
                "苜蓿夜蛾",
                "苜蓿夜蛾，学名：Heliothis dipsacea (Linnaeus)，昆虫名，为鳞翅目，夜蛾科。分布于江苏、湖北、云南、黑龙江、四川、西藏、新疆、内蒙古等。为害豌豆、大豆、向日葵、麻类、甜菜、棉、烟草、马铃薯及绿肥作物，食性很杂。初龄幼虫将叶片卷起，潜伏其中食害。长大后沿主脉暴食叶肉，形成缺刻和孔洞，并能食害豆荚。"
            )
        ),
        (
            "alfalfa plant bug",
            (
                "苜蓿盲蝽",
                "苜蓿盲蝽，学名：Adelphocoris lineolatus(Goeze)，是盲蝽科节肢动物。主要危害苜蓿、草木樨、马铃薯、棉花等农作物。"
            )
        ),
        (
            "tarnished plant bug",
            (
                "牧草盲蝽",
                "牧草盲蝽，学名：Lygus pratensis，属半翅目，盲蝽科。分布在内蒙古、宁夏、安徽、湖北、四川等地。为害玉米、小麦、棉花、豆类、蔬菜等作物。成、若虫刺吸嫩芽幼叶及叶片汁液，幼嫩组织受害后初现黑褐色小点，后变黄枯萎，展叶后出现穿孔、破裂或皱缩变黄。"
            )
        ),
        (
            "Locustoidea",
            (
                "蝗(总科)",
                "蝗(总科)，学名：Locust，直翅目下的一总科。触角短，产卵器瓣状、听器位于腹部。世界性分布，已知1万余种。中国已知700余种。陆栖性，多数种类为植食性，并且是典型的多食性。在中国有2个亚种:东亚飞蝗和亚洲飞蝗。"
            )
        ),
        (
            "lytta polita",
            (
                "磨光东鳖甲",
                "磨光东鳖甲，学名：Anatolica polita，暂无词条。"
            )
        ),
        (
            "legume blister beetle",
            (
                "豆芫菁",
                "豆芫菁，学名：Epicauta gorhami Marseul，为鞘翅目，芫菁科。从南到北广泛分布于中国很多省、区，主要以成虫为害大豆及其他豆科植物的叶片及花瓣，使受害株不能结实。此外尚能为害花生、苜蓿、棉花、马铃薯、甜菜、麻及番茄、苋菜、蕹菜等蔬菜。"
            )
        ),
        (
            "blister beetle",
            (
                "芫菁",
                "芫菁是鞘翅目芫菁科的昆虫，又名地胆。最常见的为豆芫菁，成虫黑色；头红色，具1对光亮的黑瘤；前胸背板中央和每个鞘翅中央各有1条灰白毛宽纵纹；小盾片、鞘翅侧缘、端缘和中缝，各腹节后缘均镶有灰白色绒毛。雌虫触角丝状，雄虫触角栉齿状。"
            )
        ),
        (
            "therioaphis maculata Buckton",
            (
                "苜蓿斑蚜",
                "苜蓿斑蚜，学名：Therioaphis maculata Buckton，，有翅胎生蚜成蚜体长约1.5—1.8毫米，黑绿色，有光泽。触角6节黄白色。第三节较长，上有感觉圈约4—7个。翅痣、翅脉皆橙黄色。各足褪节、胫节、跗节均暗黑色，其余部分黄白色。腹部各节背面均有硬化的暗褐色横纹，腹管黑色，圆筒状，端部稍细，具覆瓦状花纹。尾片黑色，上翘，两侧各有3根刚毛。若虫体小，黄褐色，体被薄蜡粉，腹管、尾片均黑色。无翅胎生蚜成虫体长约1.8—2.0毫米，黑色或紫黑色，有光泽，体被蜡粉。触角6节，第一至第二节、第五节末端及第六节黑色，其余部分尾黄白色。腹部体节分界不明显，背面有一块大型灰色骨化斑。若虫体小，灰紫色或黒褐色。卵长椭圆形，初产为淡黄色，后变草绿色，最后呈黑色。"
            )
        ),
        (
            "odontothrips loti",
            (
                "牛角花齿蓟马",
                "牛角花齿蓟马，学名：Odontothrips loti (Haliday)，是我国北方为害苜蓿的重要害虫之一,严重影响苜蓿的产量与质量。"
            )
        ),
        (
            "Thrips",
            (
                "蓟马",
                "蓟马，学名：Thysanoptera，昆虫纲缨翅目的统称。蓟马成虫身体黄色，前胸后缘有缘鬃，翅细长透明，周缘有许多细长毛。卵长椭圆形，初产时白色，略透明，后期橙红色。若虫体淡黄色，老熟时带桃红色。缨翅目昆虫有许多种类常栖息在大蓟、小蓟等植物的花中，故名蓟马"
            )
        ),
        (
            "alfalfa seed chalcid",
            (
                "苜蓿广肩小蜂",
                "苜蓿广肩小蜂，学名：Eurytoma aspila，成虫为小蜂，长约1．8～2mm，体呈浓黑色，只有腿部呈淡黄褐色。卵几乎无色，幼虫无足弯曲呈半圆形，头部不明显，裸蛹白色，但渐变深，接近羽化时变为黑色。卵的孵化期为4～10天，幼虫发育完全约需12～30天，随温度而异。幼虫在种子内化蛹，夏季蛹期6～10天；成虫在种皮上咬开一圆孔并羽化出来，一年发生数代。"
            )
        ),
        (
            "Pieris canidia",
            (
                "东方菜粉蝶",
                "东方菜粉蝶，学名：Pieris canidia，是粉蝶科粉蝶属的一种蝴蝶。飞行缓慢，雪白的翅膀和前翅上有淡淡的黑斑，令它们显得份外优雅。它们的幼虫嗜吃十字花科、及白花菜科植物，被视为农业害虫。 在江西以蛹越冬；越冬代成虫一般在4月上旬开始羽化。一年发生6—8代。主要分布在中国各省区；韩国，越南，老挝，缅甸，柬埔寨，泰国，土耳其。"
            )
        ),
        (
            "Apolygus lucorum",
            (
                "绿盲蝽",
                "绿盲蝽，学名：Apolygus lucorum (Meyer-Dür)，又称绿后丽盲蝽，是属半翅目盲蝽科盲蝽属昆虫。成虫体长5~5.5毫米，宽约2.5毫米，全体绿色，头宽短，复眼突出，无单眼，末端达后足基节端部，前胸背板密布刻点，黑色；若虫洋梨形，体长1~4毫米，全体鲜绿色，被稀疏黑色刚毛，头三角形，卵长1毫米左右，端部钝圆，中部略弯曲，颈部较细，卵盖中央凹陷，两端稍微突起。"
            )
        ),
        (
            "Limacodidae",
            (
                "刺蛾科",
                "刺蛾科，学名：Limacodidae，鳞翅目的一科。俗称痒辣子、火辣子、八架子、双木架子或刺毛虫。世界记载有1000种，中国记录约90种。由于这类幼虫体上有枝刺和毒毛，触及皮肤立即发生红肿，疼痛异常。"
            )
        ),
        (
            "Viteus vitifoliae",
            (
                "葡萄根瘤蚜",
                "葡萄根瘤蚜，学名：Phylloxera vitifoliae，是一种黄绿色小昆虫，同翅目(Homoptera)。严重危害欧洲和美国西部的葡萄，吮吸葡萄的汁液，在叶上形成虫瘿，在根上形成小瘤，最终植株腐烂。根瘤蚜的一生分为无翅阶段和有翅阶段，前者行孤雌生殖；後者产雌、雄蚜，交配后雌蚜产卵，以卵越冬。葡萄根瘤蚜於19世纪中期从美国东部传到欧洲，在25年内几乎摧毁了法、意、德的葡萄和酿酒业。后来人们发现，可以将欧洲的欧亚葡萄品种嫁接在美国的美洲品种抗蚜品种上才免遭毁灭。防治上，可用杂交法和熏蒸剂。主要防治还是嫁接，但在我国，根瘤蚜尚未大规模爆发，于是国内大部分葡萄其实是没有嫁接的，这也为将来埋下了一个巨大的隐患。当前，国内外很多课题组都致力于抗根瘤蚜葡萄新品种的研究工作，各有成果，但未来的路还有很长。"
            )
        ),
        (
            "Colomerus vitis",
            (
                "葡萄缺节瘿螨",
                "葡萄缺节瘿螨，学名：Colomerus newkirk et keifer，又叫葡萄潜叶壁虱、葡萄毛毡病等， 北方葡萄产区多有发生，造成早期落叶，对产量品质影响极大。叶片受害 处正面凸起，叶背下陷，在叶背下陷处生白色茸毛似毛毡状，故称毛毡病。后期叶背茸毛变黄褐，最后干枯变褐色。严重时嫩梢、卷须及幼果均可受害，影响叶片正常发育。叶片受害严重时全叶皱缩伸展不开，甚至枯死。 此虫全年均可为害，主要为害嫩叶，在春季及晚秋均有新被害状发生。"
            )
        ),
        (
            "Brevipoalpus lewisi McGregor",
            (
                "南天竹刘氏短须螨",
                "南天竹刘氏短须螨，学名：Brevipoalpus lewisi McGregor，为真螨目细须螨科短须螨属的一种螨虫。分布在河北、辽宁、山东、河南、安徽、四川、云南、台湾等地。寄主有爬山虎、白玉兰、紫丁香、南天竹、紫藤、文竹、月季、白兰花、石榴、海棠、忍冬等。成螨、幼螨、若螨多在叶背沿主脉和侧脉处吸汁为害，严重时造成叶片枯焦而早落。"
            )
        ),
        (
            "oides decempunctata",
            (
                "十星瓢萤叶甲",
                "十星瓢萤叶甲，学名：Oides decempunctata Billberg，为鞘翅目，叶甲科。在中国分布于吉林、河北、山西、陕西、甘肃、山东、河南、江苏、安徽、浙江、福建、广东、海南、广西、四川和贵州；据记载于朝鲜和越南（北部）。成虫及幼虫均取食叶片，便叶片呈孔洞或缺刻状，或将叶片吃光只留叶脉。幼虫老熟后钻入土中筑室化蛹。成虫羽化后迁至寄主危害。主要取食葡萄、野葡萄及乌敛莓等植物。"
            )
        ),
        (
            "Polyphagotars onemus latus",
            (
                "侧多食跗线螨",
                "侧多食跗线螨，学名：Polyphagotarsonemus latus (Banks)，又称黄茶螨、茶半跗线螨，俗称白蜘蛛，主要为害茶、茄科蔬菜、柑桔、老鹳草属植物，以及棉花、葡萄、豆类、马铃薯、橡胶等。 简阳县柑桔苗圃发生普遍，重者为害株率达50%以上，近年又有转移结果树上果为害的趋势，可能成为继红、黄蜘蛛后柑桔上又一新害螨。"
            )
        ),
        (
            "Pseudococcus comstocki Kuwana",
            (
                "康氏粉蚧",
                "康氏粉蚧，学名：Pseudococcus comstocki Kuwana，为同翅目（Homoptera ），是粉蚧科粉蚧属的一种昆虫。分布于黑龙江、吉林，辽宁、内蒙古、宁夏、甘肃、青海、新疆、山西、河北、山东等。寄主于 金桔、刺槐、樟树、佛手瓜、苹果、梨、桃、李、杏、山楂、葡萄君子兰、麒麟掌、竹节万年青等。若虫和雌成虫刺吸芽、叶、果实、枝叶：及根部的汁液，嫩枝和根部受害常肿胀且易纵裂而枯死。幼果受害多成畸形果。排泄蜜露常引起霉病发生，影响光合作用。"
            )
        ),
        (
            "parathrene regalis",
            (
                "葡萄透翅蛾",
                "葡萄透翅蛾，学名：Paranthrene regalis Butler，是鳞翅目，透翅蛾科的一类动物。翌年4月下旬化蛹，蛹期5~15天，6月上旬至7月上旬羽化为成虫。中国南北各地都有分布，南方主要分布于四川、重庆、贵州、江苏、浙江等省、直辖市。以幼虫蛀食葡萄枝蔓髓部，使受害部位肿大，叶片变黄脱落，枝蔓容易折断枯死，影响当年产量及树势。"
            )
        ),
        (
            "Ampelophaga",
            (
                "葡萄天蛾",
                "葡萄天蛾，学名：Ampelophaga rubiginosa，是天蛾科葡萄天蛾属的一种动物。"
            )
        ),
        (
            "Lycorma delicatula",
            (
                "斑衣蜡蝉",
                "斑衣蜡蝉，学名：Lycorma delicatula (White)，是同翅目蜡蝉科斑衣蜡蝉属昆虫，又称椿皮蜡蝉、春姑娘、花姑娘等。头部小，淡褐色；复眼黑色，触角生在复眼下方，红色，歪锥状；口器长过后足基部。前翅革质，长卵形，基半部淡褐色，上布黑斑，端半部黑色，脉纹白色；后翅膜质，扇形，基部鲜红色，有黑斑，端部黑色，在红色与黑色区域间，有白色横带，脉纹黑色。卵长圆形，褐色；若虫初孵时白色，后转灰色，最后成黑色，体背有白色蜡粉组成的斑点。成虫寿命4个月左右。"
            )
        ),
        (
            "Xylotrechus",
            (
                "四带脊虎天牛",
                "四带脊虎天牛，学名：Xylotrechus polyzonus (Fairmaire)，体长13mm，全身黄色与黑色条纹相间，呈起伏状带纹。前胸背板上有黑色锚状条纹，分布于四川、云南、贵州、北京、河北等地。"
            )
        ),
        (
            "Cicadella viridis",
            (
                "大青叶蝉",
                "大青叶蝉，学名：Cicadella viridis，是叶蝉科、大叶蝉属昆虫，俗称大绿沉浮子，其体浅绿色或深绿色，额唇基中域两纵线及两侧的印痕棕色；前胸背板前缘色浅，多呈黄绿色；雄虫尾节基部宽，向端部渐窄，末端窄圆，近端部着生许多粗刚毛；下生殖板长三角形，基部宽，端部细如指状，外缘着生许多小刚毛。"
            )
        ),
        (
            "Miridae",
            (
                "盲蝽科",
                "盲蝽科，学名：Miridae ，是昆虫纲半翅目的1科。前翅具楔片，除树盲蝽亚科外， 其余亚科无单眼的陆生蝽类昆虫。通称为盲蝽。为半翅目中最大的科。世界已知近万种，各大区均有分布。中国已有记录950种左右。"
            )
        ),
        (
            "Trialeurodes vaporariorum",
            (
                "温室白粉虱",
                "温室白粉虱，学名：Trialeurodes vaporariorum，又称温室粉虱。是昆虫纲半翅目粉虱科蜡粉虱属的昆虫。 [30]其成虫体淡黄色；翅面覆盖白蜡粉，翅端半圆状遮住整个腹部，翅脉简单，沿翅外缘有一排小颗粒；卵椭圆形，基部有卵柄；初产淡绿色，覆有蜡粉，而后渐变褐色，孵化前呈黑色；若虫淡绿色或黄绿色，足和触角退化，紧贴在叶片上营固着生活；四龄若虫又称伪蛹，椭圆形，初期体扁平，逐渐加厚，中央略高，黄褐色，体背有长短不齐的蜡丝，体侧有刺。"
            )
        ),
        (
            "Erythroneura apicalis",
            (
                "葡萄二星叶蝉",
                "葡萄二星叶蝉，学名：Erythroneura apicalis，属于同翅目，叶蝉科。又名葡萄二黄斑小叶蝉、葡萄斑叶蝉。详细链接——葡萄二星叶蝉( Erythroneura apicalis ) - 西北农林科技大学葡萄酒学院：https://wine.nwsuaf.edu.cn/zjjz/njptzpgl/bchfz1/187935.htm"
            )
        ),
        (
            "Papilio xuthus",
            (
                "柑橘凤蝶",
                "柑橘凤蝶，学名：Papilio xuthus，是鳞翅目凤蝶科凤蝶属昆虫，又称柑橘黄凤蝶、花椒凤蝶、燕凤蝶。中型凤蝶。翅底色黑褐色，翅脉黑色，各翅室内具长短不一的黄白色斑；前翅中室具4条近乎平行的黄色线纹，后翅臀区具一枚橘红色的圆斑，内具1个黑点；后翅具一对细长的尾突；春秋季羽化的个体较夏季小，翅面黄斑较发达；雌雄前翅斑纹相同，后翅色斑略异。"
            )
        ),
        (
            "Panonchus citri McGregor",
            (
                "柑橘全爪螨",
                "柑橘全爪螨，学名：Panonychus citri McGregor，俗称柑桔红蜘蛛，以口器刺破柑橘叶片表皮吸食汁液，被害叶面呈现 无数灰白色小斑点，严重时全叶失绿变成灰白色，导致大量落叶；亦能为害果实 及绿色枝梢，影响树势和产量，为我国柑桔生产的头号害虫. 柑橘全爪螨体型微小，雌成螨体长0.4毫米，椭圆形，背面隆起、深红色，雄成 螨体长0.35毫米。"
            )
        ),
        (
            "Phyllocoptes oleiverus ashmead",
            (
                "柑橘锈壁虱",
                "柑橘锈壁虱，又名橘锈螨、锈蜘蛛、柑橘锈螨、橘锈瘿螨。属蛛形纲，蜱螨目、瘿螨科。是柑橘的重要害虫，中国各个柑橘产区均有发生，危害率高达50%以上。危害叶片和果实，主要在叶片背面和果实表面吸食汁液。吸食时使油胞破坏，芳香油溢出，被空气氧化，导致叶背、果面变为黑褐色或铜绿色，严重时可引起大量落叶。幼果受害严重时变小变硬，大果受害后果皮变为黑褐色，韧而厚。果实有发酵味，品质下降。成螨体长0.1-0.2毫米，黄白色，肉眼不易见，头部附近有足二对，体躯前部较粗，尾端较细。幼虫若螨似成虫，体灰白色至浅黄色。圆球形，灰白色，半透明。"
            )
        ),
        (
            "Icerya purchasi Maskell",
            (
                "吹绵蚧壳虫",
                "吹绵蚧壳虫，学名：Icerya purchasi Maskell，是硕蚧科吹绵蚧属昆虫，别名吹绵蚧。雌成虫体椭圆或长椭圆形，橘红或暗红色，足和触角黑色；体表生有黑色短毛，向上隆起，腹面平坦。雄成虫胸部红紫色，有黑骨片，腹部橘红色；前翅狭长，暗褐色。雌性3齡、雄性2龄为若虫，各龄均椭圆形，眼、触角及足均黑色。蛹橘红色，被有白色薄蜡粉；茧长椭圆形，白色，茧质疏松，由白蜡丝组成。卵长椭圆形，初产时橙黄色，后橘红色。卵囊白色，半卵形或长形。"
            )
        ),
        (
            "Unaspis yanonensis",
            (
                "矢尖蚧",
                "矢尖蚧，学名：Unaspis yanonensis (Kuwana)，又名矢尖盾蚧、矢尖蚧壳虫、箭头蚧等，是同翅目盾蚧科矢尖蚧属害虫。雌虫蚧壳长形，稍弯曲；上端尖，下端宽，前窄后宽，末端稍窄形似箭头；蚧壳褐色或紫褐色，中央有一条纵脊，前端有两个黄褐色小壳点；体橙红色，长形，头顶较平钝，胸部长；腹部短，前胸、中胸及后胸均有横沟分开；体背面，特别是头胸部背面高度硬化；在腹部边缘有许多臀棘，背腺数目多，臀板末端较圆；雄蚧壳长形，白色，较小；体橙红色，复眼黑色，翅无色，足和尾部淡黄色。因雌成虫介壳长形，紫褐色，前窄后宽，似箭头形而故名。"
            )
        ),
        (
            "Ceroplastes rubens",
            (
                "红蜡蚧",
                "红蜡蚧，学名：Ceroplastes rubens (Maskell)，为半翅目蜡蚧科蜡蚧属的一种昆虫。分布于中国的华南、西南、华中、华东、华北及北方温室。成虫和若虫密集寄生在植物枝杆上和叶片上，吮吸汁液危害。雌虫多在植物枝杆上和叶柄上危害，雄虫多在叶柄和叶片上危害，并能诱发煤污病，致使植株长势衰退，树冠萎缩，全株发黑，严重危害则造成植物整株枯死。"
            )
        ),
        (
            "Chrysomphalus aonidum",
            (
                "黑褐圆盾蚧",
                "黑褐圆盾蚧，学名：Chrysomphalus aonidum (Linnaeus)，是盾蚧科动物。在福建一年发生4代；台湾一年发生4～6代；多数以第二龄若虫越冬。雌若虫蜕皮2次，共3龄；雄虫蜕皮3次；卯产在雌成虫的介壳下；成虫产卵期长，可达2～8星期，每头雌虫可产卵80～150粒。若虫孵化后，分散活动，在找到合适场地，即固定取食危害。在没有食料而较高温度下，可存活3～17天。在福州第一至第四代若虫的盛发期分别为：5月上、中旬，7月中旬，8月中旬至9月中旬，10月上、中旬至11月上、中旬。雌性若虫多寄生在叶背；雄性若虫多寄生于叶面危害。"
            )
        ),
        (
            "Parlatoria zizyphus Lucus",
            (
                "黑点蚧",
                "黑点蚧，学名：Parlatoria zizyphus Lucus，为同翅目，盾蚧科。中国各柑橘产区均有发生。主要危害柑桔类植物、枣子、椰子、油棕、月桂。"
            )
        ),
        (
            "Nipaecoccus vastalor",
            (
                "堆蜡粉蚧",
                "堆蜡粉蚧，学名：Nipaecoccus vastalor (Maskell)，属同翅目，粉蚧科。堆蜡粉蚧在广州每年发生5-6代，以若虫和成虫在树干、枝条的裂缝或洞穴及卷叶内越冬。若虫、成虫刺吸枝干、叶的汁液，重者叶干枯卷缩，削弱树势甚至枯死。寄主造成果树枯梢和落果，影响经济价值。主要分布于广东、广西、福建、台湾、云南、贵州、四川以及湖南、湖北、江西、浙江、陕西、山东、河北的局部地区。"
            )
        ),
        (
            "Aleurocanthus spiniferus",
            (
                "黑刺粉虱",
                "黑刺粉虱，学名：Aleurocanthus spiniferus (Quaintanca)，是半翅目粉虱科刺粉虱属昆虫，又称橘刺粉虱、刺粉虱。成虫体表覆有一层很薄的白色蜡粉；前翅淡紫色或紫褐色，表面有7个不规则的白色斑；后翅较小。幼虫体扁平，长椭圆形，初孵时无色透明，后变为灰褐色至黑色，有光泽，体躯周围有白色蜡质物；体背上有黄色刺毛4根。"
            )
        ),
        (
            "Tetradacus c Bactrocera minax",
            (
                "柑橘大实蝇",
                "柑橘大实蝇，学名：Bactrocera minax (Enderlein)，又称橘大实蝇、黄果蝇，是双翅目实蝇科果实蝇属的一种害虫。成虫淡黄褐色，复眼发达、金绿色；中胸背板中央有一“水滴形”黄色斑纹，此斑两侧各有1条黄色纵斑，小盾片黄色；触角黄色，翅透明；前缘区浅棕黄色，翅端部有棕色斑；腹部由五节组成，产卵器发达；卵乳白色，长椭圆形；老熟幼虫蛆形，体乳白或淡黄色；围蛹，椭圆形，黄褐色。"
            )
        ),
        (
            "Dacus dorsalis(Hendel)",
            (
                "柑橘小实蝇",
                "柑橘小实蝇，学名：Dacus dorsalis (Hendel)，又名黄苍蝇或果蛆，是植物检疫对象。一般分布于四川、广东、广西、福建、湖南、云南和台湾等地。主要以幼虫取食果瓤，形成蛆柑，造成腐烂，引起果实早期脱落。严重时，损失极大。"
            )
        ),
        (
            "Bactrocera tsuneonis",
            (
                "蜜柑大实蝇",
                "蜜柑大实蝇，学名：Bactrocera (Tetradacus) tsuneonis (Miyake)，是实蝇科的1种，原产于日本九州南部的野生橘林中。分布于日本九州大分、宫崎、鹿儿岛、熊本4县和奄美大岛；中国台湾省、广西壮族自治区以及越南。"
            )
        ),
        (
            "Prodenia litura",
            (
                "斜纹夜蛾",
                "斜纹夜蛾，学名：Spodoptera litura Fabricius，属鳞翅目夜蛾科斜纹夜蛾属的一个物种，是一种农作物害虫，褐色，前翅具许多斑纹，中有一条灰白色宽阔的斜纹，故名。"
            )
        ),
        (
            "Adristyrannus",
            (
                "枯叶夜蛾",
                "枯叶夜蛾，学名：Adristyrannus (Guenee)，为鳞翅目，夜蛾科。分布于江西、上海、台湾、湖北、云南、贵州、河南、安徽、辽宁、内蒙古等省。为害柑橘、苹果、葡萄、枇杷、杧果、梨、桃、杏、李、柿等植物的果实。成虫以锐利的虹吸式口器穿刺果皮。果面留有针头大的小孔，果肉失水呈海绵状，以手指按压有松软感觉，被害部变色凹陷、随后腐烂脱落。常招致胡蜂等为害，将果实食成空壳。"
            )
        ),
        (
            "Phyllocnistis citrella Stainton",
            (
                "柑橘潜叶蛾",
                "柑橘潜叶蛾，学名：Phyllocnistis citrella Stainton，又名橘潜蛾、潜叶虫、绘图虫、鬼画符，是鳞翅目叶潜蛾科一种昆虫。成虫虫体和前、后翅均为银白色，具密长缘毛，前翅缘毛短于后翅缘毛，前翅尖叶形，基部具黑褐色纵纹2条，中部有Y字形黑纹，靠近翅尖有一明显的黑斑点，后翅针叶形；卵扁圆形，无色透明；幼虫体黄绿色至黄色，头尖，足退化，腹部末端尖细；蛹纺锤形，淡黄色至深褐色，外被黄褐色薄茧。"
            )
        ),
        (
            "Toxoptera citricidus",
            (
                "橘蚜",
                "橘蚜，学名：Toxoptera citricidus (Kirkaldy)，又称花椒蚜虫，是昆虫纲同翅目蚜科声蚜属的一种昆虫，天敌瓢虫、草蛉、食蚜蝇、寄生蜂和寄生菌等。"
            )
        ),
        (
            "Toxoptera aurantii",
            (
                "小桔蚜",
                "小桔蚜，学名：Toxoptera aurantii，又名茶蚜，为常蚜科桔蚜屬下的一个种。是茶树主要害虫之一，幼虫和成虫均可刺吸茶汁，使茶树芽叶受损，其排泄物可诱导霉菌聚集于茶树叶片, 影响茶树光合作用"
            )
        ),
        (
            "Aphis citricola Vander Goot",
            (
                "苹果黄蚜",
                "苹果黄蚜，学名：Aphis citricolavander Goot，是属于半翅目蚜虫科的一种昆虫。又名绣线菊蚜。主要为害苹果、沙果、海棠、木瓜等。以若蚜、成蚜群集于寄主嫩梢、嫩叶背面及幼果表面刺吸为害，受害叶片常呈现褪绿斑点，后向背面横向卷曲或卷缩。群体密度大时，常有蚂蚁与其共生。无翅孤雌胎生蚜：体长约1.7mm，黄、黄绿或绿色；腹管圆筒形，黑色：尾片长圆锥形，黑色，有长毛9~13根。有翅孤雌胎生蚜：体长1.7mm；头、胸部黑色，腹部黄、黄绿或绿色，两侧有黑斑；腹管、尾片黑色。卵：椭圆形，漆黑色，有光泽。若蚜：形似无翅胎生雌蚜,鲜黄色，触角、复眼、足和腹管均黑色。"
            )
        ),
        (
            "Scirtothrips dorsalis Hood",
            (
                "茶黄蓟马",
                "茶黄蓟马，学名：Scirtothrips dorsalis Hood，是缨翅目马总科蓟马科的一种昆虫。在中国主要分布于海南、广东、广西、云南、浙江、福建、台湾等省区；还分布于日本、印度、马来西亚、巴基斯坦等国家。为害茶叶、花生、草霉、葡萄、芒果、山茶、柑橘、台湾相思、月季等。以成虫、若虫锉吸为害茶树新梢嫩叶，受害叶片背面主脉两侧有2条至多条纵向内凹的红褐色条纹，严重时叶背呈现一片褐纹，条纹相应的叶正面稍凸起，失去光泽，后期芽梢出现萎缩，叶片向内纵卷，叶质僵硬变脆。"
            )
        ),
        (
            "Dasineura sp",
            (
                "荔枝叶瘿蚊",
                "荔枝叶瘿蚊，学名：Dasineura sp，为双翅目，瘿蚊科。分布于广西、广东、海南等省区；以幼虫生箍，受害的点痕逐渐向叶片下背两在突起，形成瘤状虫瘿。严重时一片叶上有十多个虫瘿、一张复叶有虫瘿百以上，致使叶片扭曲。幼虫老熟钻出化蛹后，残留的虫瘿随着害叶老化逐渐干枯。有些叶片呈穿孔状。"
            )
        ),
        (
            "Lawana imitata Melichar",
            (
                "茶树白蛾蜡蝉",
                "茶树白蛾蜡蝉，学名：Lawana imitata Melichar，为同翅目，蛾蜡蝉科。分布偏南，北限未过南岭，近年浙江缙云、湖南宜章、湖北武汉时有发生。寄主植物为茶、油茶、柑橘、荔枝、龙眼、芒果、桃、李、梅、木菠萝、咖啡、石榴、无花果、木瓜、梨、胡椒等。成、若虫吸食枝条和嫩梢汁液，使其生长不良，叶片萎缩而弯曲，重者枝枯果落，影响产量和质量。排泄物可诱致煤污病发生。"
            )
        ),
        (
            "Salurnis marginella Guerr",
            (
                "褐缘蛾蜡蝉",
                "褐缘蛾蜡蝉，学名：Salurnis marginella，体长7mm；头部黄赭色；触角深褐色，端节膨大；中胸背板发达，有红褐色纵带四条，其余部分为绿色；腹部侧扁灰黄绿色，覆盖有白色蜡粉；前翅绿色或黄绿色，边缘完整。常见为害多种木本植物。"
            )
        ),
        (
            "Deporaus marginatus Pascoe",
            (
                "芒果切叶象甲",
                "芒果切叶象甲，学名：Deporaus marginatus Pascoe，为鞘翅目，象甲科。分布于中国的广西、广东、海南和台湾等省区，其他地方如缅甸、印度、斯里兰卡和马来西亚等地也有分布。寡食性，系芒果的主要害虫之一，除危害芒果外，尚可危害腰果和扁桃。芒果切叶象甲以其成虫取食嫩叶的上表皮和叶肉，导致叶片枯干；雌成虫在嫩叶上产卵，并从叶片近基部处咬断，切口齐整如刀切。为害严重的几乎将整株嫩叶全部切断，幼树受害严重时影响正常生长。"
            )
        ),
        (
            "Chlumetia transversa",
            (
                "芒果横线尾夜蛾",
                "芒果横线尾夜蛾，学名：Chlumetia transversa，属鳞翅目、夜蛾科。主要分布于广东、广西、云南、福建、海南、台湾等省区。以幼虫蛀食芒果的嫩梢、花穗，引致枯萎，严重影响幼树生长和结果树的产量。虫害株率可以达到100%可堪称为芒果的头号害虫。"
            )
        ),
        (
            "Mango flat beak leafhopper",
            (
                "芒果扁喙叶蝉",
                "芒果扁喙叶蝉，学名：Idioscopus incertus (Baker)，成虫 体长4.6～4．8毫米，楔状，赭色，头部宽于前胸背板，复、眼大而斜置；喙甚长端部膨大而扁平，雄虫呈红色而雌虫呈黑褐色。小盾片大，呈三角形，基部赭黄色而端部乳白色，两基侧角区各有一黑色三角形斑纹，基部中央亦有一呈三角形或似方形的黑色斑纹，此斑纹的端部具2条约呈八字形的黑线纹，线纹外侧上方有一呈乳白色长形的斑块，其上具一似肾形小黑斑，小盾片端部乳白色，两侧各有一小黑点。"
            )
        ),
        (
            "Rhytidodera bowrinii white",
            (
                "脊胸天牛",
                "脊胸天牛，学名：Rhytidodera bowrinii white，为鞘翅目，天牛科（Cerambycidae）。分布于广东、海南、广西、福建、四川、云南等地。寄主有芒果、腰果、人面子等。幼虫钻蛀枝条和树干，使枝条干枯，刮大风时常造成断枝或树干倒折。"
            )
        ),
        (
            "Sternochetus frigidus",
            (
                "芒果果肉象甲",
                "芒果果肉象甲，学名：Sternochetus frigidus (Fabricius)，是我国云南严重危害芒果的一种寄生害虫。形态分成虫、卵、幼虫、蛹四个阶段。可以在果树开花前在树干上涂以胶带，或涂煤油乳剂于树干进行防治。"
            )
        ),
        (
            "Cicadellidae",
            (
                "叶蝉科",
                "叶蝉科（学名：Cicadellidae，又称浮尘子；leafhoppers）是一种属于半翅目叶蝉总科之下的、一类害禾谷类、蔬菜、果树和林木等的小型昆虫。静止时两翅成屋脊状，受侵扰时会弹跳飞离。目前共分为近四十个亚科；约有两万多个物种分布于全世界各大洲。叶蝉作为半翅目最大的一个类群具有重要的经济意义。"
            )
        ),
    ].into_iter().collect();
    map
});